Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Delete Method
 Reference model objects cannot be deleted.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Delete()
Public Overrides Function Delete As Boolean
Return Value
Type: Boolean
An exception.
Exceptions
Exception | Condition
InvalidOperationException | Thrown always.
See Also
Reference
ReferenceModel Class
Tekla.Structures.Drawing Namespace